angular.module('messageDetail-service', [])
.factory('MessageDetailService', function($http){
	
	var messageDetail = {
		//messageId: 1000,
		messageTitle:      "当代核心价值观",
		messagePic:        "http://img1.imgtn.bdimg.com/it/u=1794894692,1423685501&fm=23&gp=0.jpg",
		authorName:        "佚名",
	    authorHeadImg:     "https://ss0.baidu.com/94o3dSag_xI4khGko9WTAnF6hhy/image/h%3D200/sign=758b33e74e10b912a0c1f1fef3fcfcb5/8326cffc1e178a82019b0bfcff03738da877e8c3.jpg",
		messageContent:    "党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。党的最高领导人亲自主持召开新闻舆论工作座谈会，这在党和国家历史上是第一次。一年来，全国新闻舆论战线以总书记重要讲话精神为指针，牢记职责使命，锐意改进创新，新闻舆论工作呈现出崭新气象，迸发出强大活力。",
		messageCreateTime: "2017-02-19",
	    commentNum:        25,
	    commentId:         5001,
		goodNum:           3500,
	};
	
	return {
		getMessageDetail: function(messageId) {
			messageDetail.messageId = messageId;
			return messageDetail;
		}
	}
});